examples/GPL_one_way_coupling/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
15300
(
(-0.000399455 0 3.84581e-05)
(-0.000400952 0 -1.28703e-05)
(-0.000396187 0 -6.37745e-05)
(-0.000384894 0 -0.000113652)
(-0.000367285 0 -0.000161897)
(-0.000343599 0 -0.00020711)
(-0.000314633 0 -0.000249328)
(-0.00028013 0 -0.000287297)
...
)
;

boundaryField
{
    inlet
    {
        type            ehWaveVel;
        waveName        wave1;
        value           nonuniform List<vector> 
51
(
(-0.000396187 0 6.37813e-05)
(-0.000687575 0 0.000110685)
(-0.00133352 0 0.000214628)
(-0.00250845 0 0.000403679)
(-0.00400679 0 0.000644833)
(-0.00591105 0 0.0009513)
(-0.0084328 0 0.00135701)
(-0.011802 0 0.00189884)
...
)
;
    }
    outlet
    {
        type            ehWaveVel;
        waveName        wave1;
        value           nonuniform List<vector> 
51
(
(-0.000364968 0 -0.000167241)
(-0.000633404 0 -0.000290229)
(-0.00122851 0 -0.000562794)
(-0.00231101 0 -0.00105854)
(-0.00369137 0 -0.00169088)
(-0.00544572 0 -0.0024945)
(-0.00776914 0 -0.0035584)
(-0.0108737 0 -0.00497937)
...
)
;
    }
    ground
    {
        type            ehWaveVel;
        waveName        wave1;
        value           nonuniform List<vector> 
300
(
(-0.000324619 0 3.1251e-05)
(-0.000325835 0 -1.04584e-05)
(-0.000321963 0 -5.18231e-05)
(-0.000312788 0 -9.2354e-05)
(-0.00029848 0 -0.000131559)
(-0.000279235 0 -0.0001683)
(-0.0002557 0 -0.000202609)
(-0.000227665 0 -0.000233466)
...
)
;
    }
    top
    {
        type            pressureInletOutletVelocity;
        value           nonuniform List<vector> 
300
(
(-1.49531 0 0.117701)
(-1.4985 0 -0.0395291)
(-1.48693 0 -0.201438)
(-1.4566 0 -0.385097)
(-1.4032 0 -0.586485)
(-1.32356 0 -0.780854)
(-1.22006 0 -0.949299)
(-1.09374 0 -1.0838)
...
)
;
    }
    sides
    {
        type            empty;
    }
}


// ************************************************************************* //
